RabbitMQ_Simle/src/InformationRegisters/КАБНастройкиПодключенияКRebbitMQ/КАБНастройкиПодключенияКRebbitMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАБНастройкиПодключенияКRebbitMQ</name>
  <resources>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТочкаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RabbitMQ_Simle/src/CommonModules/RebbitMQСервер/Module.bsl
#Область Настройки

Функция ПолучитьНастройкиПодключенияИзРегистра() Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАБНастройкиПодключенияКRebbitMQ.Адрес КАК Адрес,
		|	КАБНастройкиПодключенияКRebbitMQ.Порт КАК Порт,
		|	КАБНастройкиПодключенияКRebbitMQ.Логин КАК Логин,
		|	КАБНастройкиПодключенияКRebbitMQ.Пароль КАК Пароль,
		|	КАБНастройкиПодключенияКRebbitMQ.ВиртуальныйХост КАК ВиртуальныйХост,
		|	КАБНастройкиПодключенияКRebbitMQ.ТочкаОбмена КАК ТочкаОбмена,
		|	КАБНастройкиПодключенияКRebbitMQ.ИмяОчереди КАК ИмяОчереди,
		|	КАБНастройкиПодключенияКRebbitMQ.Включен КАК Включен,
		|	КАБНастройкиПодключенияКRebbitMQ.Таймаут КАК Таймаут,
		|	КАБНастройкиПодключенияКRebbitMQ.КлючМаршрута КАК КлючМаршрута
		|ИЗ
		|	РегистрСведений.КАБНастройкиПодключенияКRebbitMQ КАК КАБНастройкиПодключенияКRebbitMQ
		|ГДЕ
		|	КАБНастройкиПодключенияКRebbitMQ.Включен";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	

	
	Настройки = Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут,КлючМаршрута");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

Функция ПолучитьНастройкиПодключения(Адрес, Порт, Логин, Пароль, ВиртуальныйХост,ТочкаОбмена, ИмяОчереди, Таймаут) Экспорт  
	
	Возврат Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут",
			Адрес, Порт, Логин, Пароль, ВиртуальныйХост, ТочкаОбмена, ИмяОчереди, Таймаут);
КонецФункции

#КонецОбласти

#Область Компонента 

Функция ПолучитьКомпоненту() Экспорт 

	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпоненту(КлиентКомпоненты) Тогда
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
		
		Если РезультатПодключения Тогда
			ИнициализироватьКомпоненту(КлиентКомпоненты);
		КонецЕсли;    	
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
	
КонецФункции

Функция ИнициализироватьКомпоненту(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
